[
  {
    "title": "My Epic App",
    "date": "2021 - 2023",
    "description": "A completely new design and rebuild of the Epic mobile application. In tandem with Vail Resort’s data and infrastructure, we introduced a new and innovative way for skiers to interact with individual ski resorts and manage their Epic pass. My primary focus was on developing the SVG map, including custom styling and animated interactions, as well the individual trails and lifts pages and data. ",
    "tools": ["React Native", "Bluetooth"],
    "link": "https://www.epicpass.com/app.aspx"
  },
  {
    "title": "Vidanta World",
    "date": "2023",
    "description": "We built a new website for Vidanta World Resorts. While the site is not yet live (as of Fall/Winter 2024), I was a part of the core development team that initially built out all of the content models through Contentstack. These models were mapped to reusable pages and components, streamlining the site’s structure and content management. I also contributed to the initial styling of many shared components.",
    "tools": ["React", "Contentstack", "Apollo", "GraphQL", "CSS"]
  },
  {
    "title": "ACR",
    "date": "2021 - 2022",
    "description": "A full redesign and rebuild for the American College of Rheumatology. Leveraging Contentstack, we developed a suite of reusable page templates and content models and using GraphQL we automated the creation of dynamic pages. This allowed ACR to easily manage their content to better support doctors and clients with any number of condition pages and resources. The project began with a development team of five and gradually streamlined until I took over as the sole developer interacting with the client.",
    "tools": ["React", "Contentstack", "Apollo", "GraphQL", "CSS"],
    "link": "https://rheumatology.org/"
  },
  {
    "title": "Initiative",
    "date": "Fall 2019",
    "description": "A modern tabletop RPG companion application, built with love and some pals, aka the <a href=\"https://crit.fail/\" target=\"_blank\" ref=\"noopener noreferrer\" class=\"link rosegold\">Crit Fail Team</a>",
    "tools": ["React", "Axios", "Firebase", "SCSS"],
    "link": "https://github.com/xdesro/initiative-react"
  },
  {
    "title": "Food Truck Slack Bot",
    "date": "Spring 2019",
    "description": "A custom office wide Slack bot with custom AI to inform the company each day before lunch time which food trucks were going to be in the area.",
    "tools": [
      "JavaScript",
      "Node",
      "Express",
      "Slack",
      "Next JS",
      "cron-job",
      "Twitter API",
      "Google Calendar API"
    ],
    "link": "https://github.com/bryn-newell/food-truck-bot"
  }
]
